
*** Risks
    - Deadlocks and Livelocks
      #+BEGIN_SRC scala DON'T RUN ME
        val m1, m2 = new Object
        val shouldStart = new java.util.concurrent.atomic.AtomicBoolean(false)

        val t1 = new Thread(() => {
          while(!shouldStart.get) {}
          m1.synchronized {
            m2.synchronized {
              println("t1 done")
            }
          }
        })

        val t2 = new Thread(() => {
          while(!shouldStart.get) {}
          m2.synchronized {
            m1.synchronized {
              println("t2 done")
            }
          }
        })

        t1.start()
        t2.start()
        Thread.sleep(100)
        shouldStart.set(true)

        Thread.sleep(100)
        t1.getState
        t2.getState
      #+END_SRC

      #+RESULTS:
      #+begin_example
        m1: Object = java.lang.Object@31c0a875
        m2: Object = java.lang.Object@5675fcc5
        shouldStart: java.util.concurrent.atomic.AtomicBoolean = false
        t1: Thread = Thread[Thread-2075,5,main]
        t2: Thread = Thread[Thread-2076,5,main]
        res208: java.lang.Thread.State = *BLOCKED*
        res209: java.lang.Thread.State = *BLOCKED*
      #+end_example

    - Race conditions
      #+BEGIN_SRC scala :results silent
        var counter = 0

        val threads = 1 to 5 map { _ =>
          val t = new Thread(() => {
            var i = 0
            while(i < 10000) {
              i += 1
              counter = counter + 1
            }
          })
          t.start()
          t
        }
        threads foreach { _.join() }

        println(s"Counter should be 50000, but is " + counter)
      #+END_SRC

